bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/TINY/ATTINY461.xml
            <module name="USI">
                <instance name="USI" caption="Universal Serial Interface">
                    <register-group name="USI" name-in-module="USI" offset="0x00" address-space="data" caption="Universal Serial Interface"/>
                    <signals>
                        <signal field="USIPOS" function="USI" group="SDA" pad="PB0"/>
                        <signal field="USIPOS" function="USI" group="SCL" pad="PB2"/>
                        <signal field="USIPOS" function="USI_ALT" group="SCL " pad="PA2"/>
                        <signal field="USIPOS" function="USI_ALT" group="SDA" pad="PA0"/>
                        <signal field="USIPOS" function="USI" group="DI" pad="PB0"/>
                        <signal field="USIPOS" function="USI" group="DO" pad="PB1"/>
                        <signal field="USIPOS" function="USI" group="USCK" pad="PB2"/>
                        <signal field="USIPOS" function="USI_ALT" group="USCK" pad="PA2"/>
                        <signal field="USIPOS" function="USI_ALT" group="DO" pad="PA1"/>
                        <signal field="USIPOS" function="USI_ALT" group="DI" pad="PA0"/>
                    </signals>
                </instance>
            </module>
            <module name="EEPROM">
                <instance name="EEPROM" caption="EEPROM">
                    <register-group name="EEPROM" name-in-module="EEPROM" offset="0x00" address-space="data" caption="EEPROM"/>
                </instance>
            </module>
            <module name="WDT">
                <instance name="WDT" caption="Watchdog Timer">
                    <register-group name="WDT" name-in-module="WDT" offset="0x00" address-space="data" caption="Watchdog Timer"/>
                </instance>
            </module>
            <module name="TC8">
                <instance name="TC0" caption="Timer/Counter, 8-bit">
                    <register-group name="TC0" name-in-module="TC0" offset="0x00" address-space="data" caption="Timer/Counter, 8-bit"/>
                    <signals>
                        <signal function="T0" group="ICP0" pad="PA4"/>
                        <signal function="T0" group="T0" pad="PB6"/>
                    </signals>
                </instance>
                <instance name="TC1" caption="Timer/Counter, 8-bit">
                    <register-group name="TC1" name-in-module="TC1" offset="0x00" address-space="data" caption="Timer/Counter, 8-bit"/>
                    <signals>
                        <signal function="T1" group="OC1AINV" pad="PB0"/>
                        <signal function="T1" group="OC1A" pad="PB1"/>
                        <signal function="T1" group="OC1BINV" pad="PB2"/>
                        <signal function="T1" group="OC1B" pad="PB3"/>
                        <signal function="T1" group="OC1DINV" pad="PB4"/>
                        <signal function="T1" group="OC1D" pad="PB5"/>
                    </signals>
                </instance>
            </module>
            <module name="BOOT_LOAD">
                <instance name="BOOT_LOAD" caption="Bootloader">
                    <register-group name="BOOT_LOAD" name-in-module="BOOT_LOAD" offset="0x00" address-space="data" caption="Bootloader"/>
                </instance>
            </module>
            <module name="EXINT">
                <instance name="EXINT" caption="External Interrupts">
                    <register-group name="EXINT" name-in-module="EXINT" offset="0x00" address-space="data" caption="External Interrupts"/>
                    <signals>
                        <signal function="EXTINT" group="PCINT" index="0" pad="PA0"/>
                        <signal function="EXTINT" group="PCINT" index="1" pad="PA1"/>
                        <signal function="EXTINT" group="PCINT" index="2" pad="PA2"/>
                        <signal function="EXTINT" group="PCINT" index="3" pad="PA3"/>
                        <signal function="EXTINT" group="PCINT" index="4" pad="PA4"/>
                        <signal function="EXTINT" group="PCINT" index="5" pad="PA5"/>
                        <signal function="EXTINT" group="PCINT" index="6" pad="PA6"/>
                        <signal function="EXTINT" group="PCINT" index="7" pad="PA7"/>
                        <signal function="EXTINT" group="PCINT" index="8" pad="PB0"/>
                        <signal function="EXTINT" group="PCINT" index="9" pad="PB1"/>
                        <signal function="EXTINT" group="PCINT" index="10" pad="PB2"/>
                        <signal function="EXTINT" group="PCINT" index="11" pad="PB3"/>
                        <signal function="EXTINT" group="PCINT" index="12" pad="PB4"/>
                        <signal function="EXTINT" group="PCINT" index="13" pad="PB5"/>
                        <signal function="EXTINT" group="PCINT" index="14" pad="PB6"/>
                        <signal function="EXTINT" group="PCINT" index="15" pad="PB7"/>
                        <signal function="EXTINT" group="INT" index="1" pad="PA2"/>
                        <signal function="EXTINT" group="INT" index="0" pad="PB6"/>
                    </signals>
                </instance>
            </module>
            <module name="CPU">
                <instance name="CPU" caption="CPU Registers">
                    <register-group name="CPU" name-in-module="CPU" offset="0x00" address-space="data" caption="CPU Registers"/>
                    <parameters>
                        <param name="CORE_VERSION" value="V2"/>
                        <param name="NEW_INSTRUCTIONS" value="lpm rd,z+"/>
                    </parameters>
                </instance>
            </module>
            <module name="FUSE">
                <instance name="FUSE" caption="Fuses">
                    <register-group name="FUSE" name-in-module="FUSE" offset="0" address-space="fuses" caption="Fuses"/>
                </instance>
            </module>
            <module name="LOCKBIT">
                <instance name="LOCKBIT" caption="Lockbits">
                    <register-group name="LOCKBIT" name-in-module="LOCKBIT" offset="0" address-space="lockbits" caption="Lockbits"/>
