bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/TINY/ATTINY461.xml
                <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
                    <bitfield caption="Pull-up Disable" mask="0x40" name="PUD"/>
                    <bitfield caption="Sleep Enable" mask="0x20" name="SE"/>
                    <bitfield caption="Sleep Mode Select Bits" mask="0x18" name="SM" values="CPU_SLEEP_MODE"/>
                    <bitfield caption="Interrupt Sense Control 0 bits" mask="0x03" name="ISC0" values="INTERRUPT_SENSE_CONTROL2"/>
                </register>
                <register caption="MCU Status register" name="MCUSR" offset="0x54" size="1">
                    <bitfield caption="Watchdog Reset Flag" mask="0x08" name="WDRF"/>
                    <bitfield caption="Brown-out Reset Flag" mask="0x04" name="BORF"/>
                    <bitfield caption="External Reset Flag" mask="0x02" name="EXTRF"/>
                    <bitfield caption="Power-On Reset Flag" mask="0x01" name="PORF"/>
                </register>
                <register caption="Oscillator Calibration Register" name="OSCCAL" offset="0x51" size="1" mask="0xFF" ocd-rw="R">
                    <bitfield caption="Oscillator Calibration " mask="0xFF" name="OSCCAL"/>
                </register>
                <register caption="Clock Prescale Register" name="CLKPR" offset="0x48" size="1" ocd-rw="R">
                    <bitfield caption="Clock Prescaler Change Enable" mask="0x80" name="CLKPCE"/>
                    <bitfield caption="Clock Prescaler Select Bits" mask="0x0F" name="CLKPS" values="CPU_CLK_PRESCALE_4_BITS_SMALL"/>
                </register>
                <register caption="PLL Control and status register" name="PLLCSR" offset="0x49" size="1">
                    <bitfield caption="Low speed mode" mask="0x80" name="LSM"/>
                    <bitfield caption="PCK Enable" mask="0x04" name="PCKE"/>
                    <bitfield caption="PLL Enable" mask="0x02" name="PLLE"/>
                    <bitfield caption="PLL Lock detector" mask="0x01" name="PLOCK"/>
                </register>
                <register caption="debugWire data register" name="DWDR" offset="0x40" size="1" mask="0xFF" ocd-rw=""/>
                <register caption="General Purpose IO register 2" name="GPIOR2" offset="0x2C" size="1" mask="0xFF"/>
                <register caption="General Purpose register 1" name="GPIOR1" offset="0x2B" size="1" mask="0xFF"/>
                <register caption="General purpose register 0" name="GPIOR0" offset="0x2A" size="1" mask="0xFF"/>
            </register-group>
            <value-group caption="" name="CPU_SLEEP_MODE">
                <value caption="Idle" name="IDLE" value="0x00"/>
                <value caption="ADC Noise Reduction (If Available)" name="ADC" value="0x01"/>
                <value caption="Power Down" name="PDOWN" value="0x02"/>
                <value caption="Standby" name="STDBY" value="0x03"/>
            </value-group>
            <value-group caption="" name="INTERRUPT_SENSE_CONTROL2">
                <value caption="Low Level of INTX" name="VAL_0x00" value="0x00"/>
                <value caption="Any Logical Change in INTX" name="VAL_0x01" value="0x01"/>
                <value caption="Falling Edge of INTX" name="VAL_0x02" value="0x02"/>
                <value caption="Rising Edge of INTX" name="VAL_0x03" value="0x03"/>
            </value-group>
            <value-group caption="" name="CPU_CLK_PRESCALE_4_BITS_SMALL">
                <value caption="1" name="VAL_0x00" value="0x00"/>
                <value caption="2" name="VAL_0x01" value="0x01"/>
                <value caption="4" name="VAL_0x02" value="0x02"/>
                <value caption="8" name="VAL_0x03" value="0x03"/>
                <value caption="16" name="VAL_0x04" value="0x04"/>
                <value caption="32" name="VAL_0x05" value="0x05"/>
                <value caption="64" name="VAL_0x06" value="0x06"/>
                <value caption="128" name="VAL_0x07" value="0x07"/>
                <value caption="256" name="VAL_0x08" value="0x08"/>
            </value-group>
            <value-group caption="Oscillator Calibration Values" name="OSCCAL_VALUE_ADDRESSES">
                <value value="0x00" caption="8.0 MHz" name="8_0_MHz"/>
            </value-group>
        </module>
        <module caption="External Interrupts" name="EXINT">
            <register-group caption="External Interrupts" name="EXINT">
                <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
                    <bitfield caption="Interrupt Sense Control 0 Bit 1" mask="0x02" name="ISC01"/>
                    <bitfield caption="Interrupt Sense Control 0 Bit 0" mask="0x01" name="ISC00" values="INTERRUPT_SENSE_CONTROL"/>
                </register>
                <register caption="General Interrupt Mask Register" name="GIMSK" offset="0x5B" size="1">
                    <bitfield caption="External Interrupt Request 1 Enable" mask="0xC0" name="INT"/>
                    <bitfield caption="Pin Change Interrupt Enables" mask="0x30" name="PCIE"/>
                </register>
                <register caption="General Interrupt Flag register" name="GIFR" offset="0x5A" size="1" ocd-rw="R">
                    <bitfield caption="External Interrupt Flags" mask="0xC0" name="INTF"/>
                    <bitfield caption="Pin Change Interrupt Flag" mask="0x20" name="PCIF"/>
                </register>
                <register caption="Pin Change Enable Mask 1" name="PCMSK1" offset="0x42" size="1" mask="0xFF"/>
                <register caption="Pin Change Enable Mask 0" name="PCMSK0" offset="0x43" size="1" mask="0xFF"/>
            </register-group>
            <value-group caption="Interrupt Sense Control" name="INTERRUPT_SENSE_CONTROL">
                <value caption="Low Level of INTX" name="VAL_0x00" value="0x00"/>
                <value caption="Any Logical Change of INTX" name="VAL_0x01" value="0x01"/>
                <value caption="Falling Edge of INTX" name="VAL_0x02" value="0x02"/>
                <value caption="Rising Edge of INTX" name="VAL_0x03" value="0x03"/>
            </value-group>
        </module>
    </modules>
    <pinouts>
        <pinout name="SOIC_20">
            <pin pad="PB0" position="1"/>
            <pin pad="PB1" position="2"/>
            <pin pad="PB2" position="3"/>
            <pin pad="PB3" position="4"/>
            <pin pad="VCC" position="5"/>
            <pin pad="GND" position="6"/>
            <pin pad="PB4" position="7"/>
            <pin pad="PB5" position="8"/>
            <pin pad="PB6" position="9"/>
            <pin pad="PB7" position="10"/>
            <pin pad="PA7" position="11"/>
            <pin pad="PA6" position="12"/>
            <pin pad="PA5" position="13"/>
            <pin pad="PA4" position="14"/>
            <pin pad="AVCC" position="15"/>
            <pin pad="AGND" position="16"/>
            <pin pad="PA3" position="17"/>
            <pin pad="PA2" position="18"/>
            <pin pad="PA1" position="19"/>
            <pin pad="PA0" position="20"/>
        </pinout>
        <pinout name="QFN_32">
            <pin position="1" pad="NC"/>
            <pin position="2" pad="PB3"/>
            <pin position="3" pad="NC"/>
            <pin position="4" pad="VCC"/>
            <pin position="5" pad="GND"/>
            <pin position="6" pad="NC"/>
            <pin position="7" pad="PB4"/>
            <pin position="8" pad="PB5"/>
            <pin position="9" pad="NC"/>
            <pin position="10" pad="PB6"/>
            <pin position="11" pad="PB7"/>
            <pin position="12" pad="NC"/>
            <pin position="13" pad="PA7"/>
            <pin position="14" pad="PA6"/>
            <pin position="15" pad="PA5"/>
            <pin position="16" pad="NC"/>
            <pin position="17" pad="PA4"/>
            <pin position="18" pad="AVCC"/>
            <pin position="19" pad="NC"/>
            <pin position="20" pad="NC"/>
            <pin position="21" pad="AGND"/>
            <pin position="22" pad="PA3"/>
            <pin position="23" pad="PA2"/>
            <pin position="24" pad="NC"/>
            <pin position="25" pad="PA1"/>
            <pin position="26" pad="PA0"/>
            <pin position="27" pad="NC"/>
            <pin position="28" pad="NC"/>
            <pin position="29" pad="NC"/>
            <pin position="30" pad="PB0"/>
            <pin position="31" pad="PB1"/>
            <pin position="32" pad="PB2"/>
        </pinout>
    </pinouts>
</target-description-file>
